<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE MgmtTree PUBLIC " -//OMA//DTD-DM-DDF 1.2//EN"
  "http://www.openmobilealliance.org/tech/DTD/DM_DDF-V1_2.dtd"
  [<?oma-dm-ddf-ver supported-versions="1.2"?>]>
<MgmtTree xmlns:MSFT="http://schemas.microsoft.com/MobileDevice/DM">
  <VerDTD>1.2</VerDTD>
  <Node>
    <NodeName>Kerberos</NodeName>
    <Path>./Device/Vendor/MSFT/Policy/Config</Path>
    <DFProperties>
      <AccessType>
        <Get />
      </AccessType>
      <DFFormat>
        <node />
      </DFFormat>
      <Occurrence>
        <One />
      </Occurrence>
      <Scope>
        <Permanent />
      </Scope>
      <DFType>
        <MIME>com.microsoft/11/MDM/Policy</MIME>
      </DFType>
    </DFProperties>
    <Node>
      <NodeName>RequireKerberosArmoring</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description></Description>
        <DFFormat>
          <chr />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.15063</MSFT:OsBuildVersion>
          <MSFT:CspVersion>5.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ADMX">
          <MSFT:AdmxBacked Area="Kerberos~AT~System~kerberos" Name="ClientRequireFast" File="Kerberos.admx" />
        </MSFT:AllowedValues>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>KerberosClientSupportsClaimsCompoundArmor</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description></Description>
        <DFFormat>
          <chr />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.15063</MSFT:OsBuildVersion>
          <MSFT:CspVersion>5.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ADMX">
          <MSFT:AdmxBacked Area="Kerberos~AT~System~kerberos" Name="EnableCbacAndArmor" File="Kerberos.admx" />
        </MSFT:AllowedValues>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>RequireStrictKDCValidation</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description></Description>
        <DFFormat>
          <chr />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.15063</MSFT:OsBuildVersion>
          <MSFT:CspVersion>5.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ADMX">
          <MSFT:AdmxBacked Area="Kerberos~AT~System~kerberos" Name="ValidateKDC" File="Kerberos.admx" />
        </MSFT:AllowedValues>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>SetMaximumContextTokenSize</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description></Description>
        <DFFormat>
          <chr />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.15063</MSFT:OsBuildVersion>
          <MSFT:CspVersion>5.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ADMX">
          <MSFT:AdmxBacked Area="Kerberos~AT~System~kerberos" Name="MaxTokenSize" File="Kerberos.admx" />
        </MSFT:AllowedValues>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowForestSearchOrder</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description></Description>
        <DFFormat>
          <chr />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.15063</MSFT:OsBuildVersion>
          <MSFT:CspVersion>5.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ADMX">
          <MSFT:AdmxBacked Area="Kerberos~AT~System~kerberos" Name="ForestSearch" File="Kerberos.admx" />
        </MSFT:AllowedValues>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>UPNNameHints</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Devices joined to Azure Active Directory in a hybrid environment need to interact with Active Directory Domain Controllers, but they lack the built-in ability to find a Domain Controller that a domain-joined device has. This can cause failures when such a device needs to resolve an AAD UPN into an Active Directory Principal.                                  This parameter adds a list of domains that an Azure Active Directory joined device should attempt to contact if it is otherwise unable to resolve a UPN to a principal.</Description>
        <DFFormat>
          <chr />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.17763</MSFT:OsBuildVersion>
          <MSFT:CspVersion>8.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="None">
          <MSFT:List Delimiter="0xF000" />
        </MSFT:AllowedValues>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>PKInitHashAlgorithmConfiguration</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Configure hash algorithms for certificate logon</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.22621</MSFT:OsBuildVersion>
          <MSFT:CspVersion>11.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Disabled / Not Configured</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Enabled</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="PKInitHashAlgorithmConfiguration" GpAreaPath="Kerberos~AT~System~kerberos" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>PKInitHashAlgorithmSHA1</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Configure SHA-1 hash algorithm for certificate logon</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.22621</MSFT:OsBuildVersion>
          <MSFT:CspVersion>11.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not Supported</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Default</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>2</MSFT:Value>
            <MSFT:ValueDescription>Audited</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>3</MSFT:Value>
            <MSFT:ValueDescription>Supported</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="PKInitHashAlgorithmSHA1" GpAreaPath="Kerberos~AT~System~kerberos" />
        <MSFT:DependencyBehavior>
          <MSFT:DependencyGroup FriendlyId="PKINIT_Hash_Algorithm_Configuration_DependencyGroup">
            <MSFT:Dependency Type="DependsOn">
              <MSFT:DependencyUri>Device/Vendor/MSFT/Policy/Config/Kerberos/PKInitHashAlgorithmConfigurationEnabled</MSFT:DependencyUri>
              <MSFT:DependencyAllowedValue ValueType="Range">
                <MSFT:Value>[1]</MSFT:Value>
              </MSFT:DependencyAllowedValue>
            </MSFT:Dependency>
          </MSFT:DependencyGroup>
        </MSFT:DependencyBehavior>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>PKInitHashAlgorithmSHA256</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Configure SHA-256 hash algorithm for certificate logon</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.22621</MSFT:OsBuildVersion>
          <MSFT:CspVersion>11.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not Supported</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Default</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>2</MSFT:Value>
            <MSFT:ValueDescription>Audited</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>3</MSFT:Value>
            <MSFT:ValueDescription>Supported</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="PKInitHashAlgorithmSHA256" GpAreaPath="Kerberos~AT~System~kerberos" />
        <MSFT:DependencyBehavior>
          <MSFT:DependencyGroup FriendlyId="PKINIT_Hash_Algorithm_Configuration_DependencyGroup">
            <MSFT:Dependency Type="DependsOn">
              <MSFT:DependencyUri>Device/Vendor/MSFT/Policy/Config/Kerberos/PKInitHashAlgorithmConfigurationEnabled</MSFT:DependencyUri>
              <MSFT:DependencyAllowedValue ValueType="Range">
                <MSFT:Value>[1]</MSFT:Value>
              </MSFT:DependencyAllowedValue>
            </MSFT:Dependency>
          </MSFT:DependencyGroup>
        </MSFT:DependencyBehavior>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>PKInitHashAlgorithmSHA384</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Configure SHA-384 hash algorithm for certificate logon</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.22621</MSFT:OsBuildVersion>
          <MSFT:CspVersion>11.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not Supported</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Default</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>2</MSFT:Value>
            <MSFT:ValueDescription>Audited</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>3</MSFT:Value>
            <MSFT:ValueDescription>Supported</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="PKInitHashAlgorithmSHA384" GpAreaPath="Kerberos~AT~System~kerberos" />
        <MSFT:DependencyBehavior>
          <MSFT:DependencyGroup FriendlyId="PKINIT_Hash_Algorithm_Configuration_DependencyGroup">
            <MSFT:Dependency Type="DependsOn">
              <MSFT:DependencyUri>Device/Vendor/MSFT/Policy/Config/Kerberos/PKInitHashAlgorithmConfigurationEnabled</MSFT:DependencyUri>
              <MSFT:DependencyAllowedValue ValueType="Range">
                <MSFT:Value>[1]</MSFT:Value>
              </MSFT:DependencyAllowedValue>
            </MSFT:Dependency>
          </MSFT:DependencyGroup>
        </MSFT:DependencyBehavior>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>PKInitHashAlgorithmSHA512</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Configure SHA-512 hash algorithm for certificate logon</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.22621</MSFT:OsBuildVersion>
          <MSFT:CspVersion>11.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not Supported</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Default</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>2</MSFT:Value>
            <MSFT:ValueDescription>Audited</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>3</MSFT:Value>
            <MSFT:ValueDescription>Supported</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="PKInitHashAlgorithmSHA512" GpAreaPath="Kerberos~AT~System~kerberos" />
        <MSFT:DependencyBehavior>
          <MSFT:DependencyGroup FriendlyId="PKINIT_Hash_Algorithm_Configuration_DependencyGroup">
            <MSFT:Dependency Type="DependsOn">
              <MSFT:DependencyUri>Device/Vendor/MSFT/Policy/Config/Kerberos/PKInitHashAlgorithmConfigurationEnabled</MSFT:DependencyUri>
              <MSFT:DependencyAllowedValue ValueType="Range">
                <MSFT:Value>[1]</MSFT:Value>
              </MSFT:DependencyAllowedValue>
            </MSFT:Dependency>
          </MSFT:DependencyGroup>
        </MSFT:DependencyBehavior>
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>CloudKerberosTicketRetrievalEnabled</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Allow retrieving the cloud kerberos ticket during the logon</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.22000</MSFT:OsBuildVersion>
          <MSFT:CspVersion>11.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Disabled.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Enabled.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="CloudKerberosTicketRetrievalEnabled" GpAreaPath="Kerberos~AT~System~kerberos" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
  </Node>
</MgmtTree>