<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE MgmtTree PUBLIC " -//OMA//DTD-DM-DDF 1.2//EN"
  "http://www.openmobilealliance.org/tech/DTD/DM_DDF-V1_2.dtd"
  [<?oma-dm-ddf-ver supported-versions="1.2"?>]>
<MgmtTree xmlns:MSFT="http://schemas.microsoft.com/MobileDevice/DM">
  <VerDTD>1.2</VerDTD>
  <Node>
    <NodeName>Search</NodeName>
    <Path>./Device/Vendor/MSFT/Policy/Config</Path>
    <DFProperties>
      <AccessType>
        <Get />
      </AccessType>
      <DFFormat>
        <node />
      </DFFormat>
      <Occurrence>
        <One />
      </Occurrence>
      <Scope>
        <Permanent />
      </Scope>
      <DFType>
        <MIME>com.microsoft/11/MDM/Policy</MIME>
      </DFType>
    </DFProperties>
    <Node>
      <NodeName>AllowIndexingEncryptedStoresOrItems</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Allows or disallows the indexing of items. This switch is for the Windows Search Indexer, which controls whether it will index items that are encrypted, such as the Windows Information Protection (WIP) protected files. When the policy is enabled, WIP protected items are indexed and the metadata about them are stored in an unencrypted location. The metadata includes things like file path and date modified. When the policy is disabled, the WIP protected items are not indexed and do not show up in the results in Cortana or file explorer. There may also be a performance impact on photos and Groove apps if there are a lot of WIP protected media files on the device. Most restricted value is 0.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.14393</MSFT:OsBuildVersion>
          <MSFT:CspVersion>4.1</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="AllowIndexingEncryptedStoresOrItems" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowSearchToUseLocation</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Specifies whether search can leverage location information. Most restricted value is 0.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.10240</MSFT:OsBuildVersion>
          <MSFT:CspVersion>1.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x88;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="AllowSearchToUseLocation" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowStoringImagesFromVisionSearch</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>This policy has been deprecated.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.10240</MSFT:OsBuildVersion>
          <MSFT:CspVersion>1.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowUsingDiacritics</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Allows the use of diacritics. Most restricted value is 0.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.14393</MSFT:OsBuildVersion>
          <MSFT:CspVersion>4.1</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="AllowUsingDiacritics" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>HighestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AlwaysUseAutoLangDetection</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Specifies whether to always use automatic language detection when indexing content and properties. Most restricted value is 0.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.14393</MSFT:OsBuildVersion>
          <MSFT:CspVersion>4.1</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="AlwaysUseAutoLangDetection" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>HighestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>DisableBackoff</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>If enabled, the search indexer backoff feature will be disabled. Indexing will continue at full speed even when system activity is high. If disabled, backoff logic will be used to throttle back indexing activity when system activity is high. Default is disabled.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.14393</MSFT:OsBuildVersion>
          <MSFT:CspVersion>4.1</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Disable.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Enable.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="DisableBackoff" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>HighestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>DisableRemovableDriveIndexing</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>This policy setting configures whether or not locations on removable drives can be added to libraries. If you enable this policy setting, locations on removable drives cannot be added to libraries. In addition, locations on removable drives cannot be indexed. If you disable or do not configure this policy setting, locations on removable drives can be added to libraries. In addition, locations on removable drives can be indexed.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.14393</MSFT:OsBuildVersion>
          <MSFT:CspVersion>4.1</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Disable.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Enable.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="DisableRemovableDriveIndexing" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>HighestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>DisableSearch</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Enabling this policy completely disables Search UI and all its entry points such as keyboard shortcuts and touchpad gestures. It removes the Search button from the Taskbar and the corresponding option in the Settings. It also disables type-to-search in the Start menu and removes the Start menu's search box.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.22621</MSFT:OsBuildVersion>
          <MSFT:CspVersion>11.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Do not disable.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Disable.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="DisableSearch" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>HighestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>PreventIndexingLowDiskSpaceMB</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Enabling this policy prevents indexing from continuing after less than the specified amount of hard drive space is left on the same drive as the index location. Select between 0 and 1. Enable this policy if computers in your environment have extremely limited hard drive space. When this policy is disabled or not configured, Windows Desktop Search automatically manages your index size.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.14393</MSFT:OsBuildVersion>
          <MSFT:CspVersion>4.1</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Disable.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Enable.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="StopIndexingOnLimitedHardDriveSpace" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>HighestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>PreventRemoteQueries</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>If enabled, clients will be unable to query this computer's index remotely. Thus, when they are browsing network shares that are stored on this computer, they will not search them using the index. If disabled, client search requests will use this computer's index. .</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.14393</MSFT:OsBuildVersion>
          <MSFT:CspVersion>4.1</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Disable.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Enable.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="PreventRemoteQueries" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>HighestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>SafeSearchPermissions</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>This policy is deprecated.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.14393</MSFT:OsBuildVersion>
          <MSFT:CspVersion>4.1</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Enable</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Disable</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:Deprecated OsBuildDeprecated="10.0.22000" />
        <MSFT:ConflictResolution>HighestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowWindowsIndexer</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Allow Windows indexer. Value type is integer.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>3</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.10240</MSFT:OsBuildVersion>
          <MSFT:CspVersion>1.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="Range">
          <MSFT:Value>[0-3]</MSFT:Value>
        </MSFT:AllowedValues>
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowCloudSearch</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Allow search and Cortana to search cloud sources like OneDrive and SharePoint. This policy allows corporate administrators to control whether employees can turn off/on the search of these cloud sources. The default policy value is to allow employees access to the setting that controls search of cloud sources.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.16299</MSFT:OsBuildVersion>
          <MSFT:CspVersion>6.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Allowed.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="AllowCloudSearch" GpAreaPath="Search~AT~WindowsComponents~Search" GpElement="AllowCloudSearch_Dropdown" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>DoNotUseWebResults</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Don't search the web or display web results in Search. This policy setting allows you to control whether or not Search can perform queries on the web, and if the web results are displayed in Search. If you enable this policy setting, queries won't be performed on the web and web results won't be displayed when a user performs a query in Search. If you disable this policy setting, queries will be performed on the web and web results will be displayed when a user performs a query in Search.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.17134</MSFT:OsBuildVersion>
          <MSFT:CspVersion>7.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not allowed. Queries won't be performed on the web and web results won't be displayed when a user performs a query in Search.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Allowed. Queries will be performed on the web and web results will be displayed when a user performs a query in Search.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="DoNotUseWebResults" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowCortanaInAAD</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>This features allows you to show the cortana opt-in page during Windows Setup</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>0</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.17134</MSFT:OsBuildVersion>
          <MSFT:CspVersion>7.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Not allowed. The Cortana consent page will not appear in AAD OOBE during setup.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Allowed. The Cortana consent page will appear in Azure AAD OOBE during setup.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="AllowCortanaInAAD" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowFindMyFiles</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>This feature allows you to disable find my files completely on the machine</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>10.0.18362</MSFT:OsBuildVersion>
          <MSFT:CspVersion>9.0</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Find My Files feature can be toggled (still off by default), and the settings UI is present.</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Find My Files feature is turned off completely, and the settings UI is disabled.</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="AllowFindMyFiles" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>AllowSearchHighlights</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description></Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>1</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion></MSFT:OsBuildVersion>
          <MSFT:CspVersion></MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="Range">
          <MSFT:Value>[0-1]</MSFT:Value>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="AllowSearchHighlights" GpAreaPath="Search~AT~WindowsComponents~Search" />
        <MSFT:ConflictResolution>LowestValueMostSecure</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
    <Node>
      <NodeName>ConfigureSearchOnTaskbarMode</NodeName>
      <DFProperties>
        <AccessType>
          <Add />
          <Delete />
          <Get />
          <Replace />
        </AccessType>
        <Description>Configures search on the taskbar. If you disable this policy setting or do not configure it, users can see and change this setting.</Description>
        <DFFormat>
          <int />
        </DFFormat>
        <Occurrence>
          <ZeroOrOne />
        </Occurrence>
        <Scope>
          <Dynamic />
        </Scope>
        <DFType>
          <MIME>text/plain</MIME>
        </DFType>
        <DefaultValue>3</DefaultValue>
        <MSFT:Applicability>
          <MSFT:OsBuildVersion>99.9.99999</MSFT:OsBuildVersion>
          <MSFT:CspVersion>9.9</MSFT:CspVersion>
          <MSFT:EditionAllowList>0x4;0x1B;0x30;0x31;0x48;0x54;0x79;0x7A;0x7D;0x7E;0x81;0x82;0x8A;0x8B;0xA1;0xA2;0xA4;0xA5;0xAB;0xAC;0xAF;0xBC;0xBF;0xCA;0xCB;0xCD;</MSFT:EditionAllowList>
        </MSFT:Applicability>
        <MSFT:AllowedValues ValueType="ENUM">
          <MSFT:Enum>
            <MSFT:Value>0</MSFT:Value>
            <MSFT:ValueDescription>Hide</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>1</MSFT:Value>
            <MSFT:ValueDescription>Search icon only</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>2</MSFT:Value>
            <MSFT:ValueDescription>Search icon and label</MSFT:ValueDescription>
          </MSFT:Enum>
          <MSFT:Enum>
            <MSFT:Value>3</MSFT:Value>
            <MSFT:ValueDescription>Search box</MSFT:ValueDescription>
          </MSFT:Enum>
        </MSFT:AllowedValues>
        <MSFT:GpMapping GpEnglishName="ConfigureSearchOnTaskbarMode" GpAreaPath="Search~AT~WindowsComponents~Search" GpElement="ConfigureSearchOnTaskbarMode_Dropdown" />
        <MSFT:ConflictResolution>LastWrite</MSFT:ConflictResolution>
      </DFProperties>
    </Node>
  </Node>
</MgmtTree>